In [5]:
import sqlite3
import os
import pandas as pd

DB_NAME = "data/customers.db"

if os.path.exists(DB_NAME):
    os.remove(DB_NAME)
    print("Existing database removed.")

conn = sqlite3.connect(DB_NAME)
cursor = conn.cursor()


cursor.execute("""
CREATE TABLE customers (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    firstname TEXT NOT NULL,
    lastname TEXT NOT NULL,
    birthdate TEXT,
    gender TEXT,
    email TEXT UNIQUE,
    city TEXT,
    balance REAL
)
""")

customers = [
    ("Ali", "Kalbaliyev", "1990-02-01", "Male", "ali.kelbeliyev@example.az", "Bakı", 1200.50),
    ("Orxan", "Hasanov", "1979-03-05", "Male", "orxan.hesenov@example.az", "Gəncə", 850.75),
    ("Yusif", "Mammadov", "1995-11-23", "Male", "yusif.memmedov@example.az", "Sumqayıt", 1325.20),
]

cursor.executemany("""
INSERT INTO customers (firstname, lastname, birthdate, gender, email, city, balance)
VALUES (?, ?, ?, ?, ?, ?, ?)
""", customers)


conn.commit()
conn.close()

Existing database removed.

In [ ]:
conn = sqlite3.connect("data/customers.db")
df = pd.read_sql_query("SELECT * FROM customers", conn)
conn.close()
df

,id,firstname,lastname,birthdate,gender,email,city,balance
0,1,Ali,Kalbaliyev,1990-02-01,Male,ali.kelbeliyev@example.az,Bakı,1200.50
1,2,Orxan,Hasanov,1979-03-05,Male,orxan.hesenov@example.az,Gəncə,850.75
2,3,Yusif,Mammadov,1995-11-23,Male,yusif.memmedov@example.az,Sumqayıt,1325.20

In [10]:
# Connect DB and fetch data

In [11]:
import sqlite3
conn = sqlite3.connect("data/customers.db")
cursor = conn.cursor()
username='Ali'
cursor.execute("""SELECT id, firstname, lastname, email, city, birthdate, balance FROM customers WHERE firstname = ? """, (username,))
row = cursor.fetchone()
conn.close()

In [3]:
import sqlite3
conn = sqlite3.connect("data/customers.db")
cursor = conn.cursor()
cursor.execute("""SELECT * FROM customers """)
row = cursor.fetchall()
conn.close()